Coding/Cpp/map_set.html
<?xml version="1.0" encoding="gb18030"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>STL：映射 集合</title>
<meta http-equiv="Content-Type" content="text/html;charset=gb18030"/>
<meta name="title" content="STL：映射 集合"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-12-02 00:29:21 CST"/>
<meta name="author" content="visayafan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<div id="org-div-comments"><a href="../../index.html#cpp">主页</a><br/><a href="#disqus_thread">评论</a></div>


</head>
<body>


<div id="content">
<h1 class="title">STL：映射 集合</h1>


<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/vf.css" />
<script src="../../Layout/JS/jquery_1.7.1.js"></script>
<script src="../../Layout/JS/bootstrap_old.js"></script>


<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 map</a>
<ul>
<li><a href="#sec-1-1">1.1 key_type mapped_type value_type</a></li>
<li><a href="#sec-1-2">1.2 map.insert()</a></li>
<li><a href="#sec-1-3">1.3 key_comp()与value_comp()</a></li>
<li><a href="#sec-1-4">1.4 equal_range()</a></li>
<li><a href="#sec-1-5">1.5 upper_bound lower_bound</a></li>
<li><a href="#sec-1-6">1.6 size() max_size()</a></li>
</ul>
</li>
<li><a href="#sec-2">2 set</a>
<ul>
<li><a href="#sec-2-1">2.1 insert</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> map</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> key_type mapped_type value_type</h3>
<div class="outline-text-3" id="text-1-1">

<p>   前两个分别为键值。<br/>
   最后一个是(key_type, mapped_type)即pair类型。<br/>
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> map.insert()</h3>
<div class="outline-text-3" id="text-1-2">




<pre class="src src-c++"><span style="color: #228b22;">pair</span>&lt;<span style="color: #228b22;">iterator</span>,<span style="color: #228b22;">bool</span>&gt; <span style="color: #0000ff;">insert</span>( <span style="color: #a020f0;">const</span> <span style="color: #228b22;">TYPE</span>&amp; <span style="color: #a0522d;">pair</span> )
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">insert</span>( <span style="color: #228b22;">input_iterator</span> <span style="color: #a0522d;">start</span>, <span style="color: #228b22;">input_iterator</span> <span style="color: #a0522d;">end</span> );
<span style="color: #228b22;">iterator</span> <span style="color: #0000ff;">insert</span>( <span style="color: #228b22;">iterator</span> <span style="color: #a0522d;">pos</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">TYPE</span>&amp; <span style="color: #a0522d;">pair</span> );
</pre>

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> key_comp()与value_comp()</h3>
<div class="outline-text-3" id="text-1-3">

<p>  key_compare key_comp() const;<br/>
  The function key_comp() returns the function that compares keys. <br/>
</p>


<pre class="src src-c++">m2[0]=1;
m2[1]=2;
m2[2]=1;
m2[3]=2;
<span style="color: #a020f0;">for</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>=0; i&lt;4; i++){
    <span style="color: #a020f0;">if</span>(!m2.key_comp()(i, m2[i]))
        cout&lt;&lt;m2[i]&lt;&lt;endl;
}
</pre>

<dl>
<dt>解析</dt><dd>
<p>
  m2.key_comp() 返回比较函数。i, m2[i]作为返回函数的参数，若i&lt;m2[i]为真，否则为假，又有!所以若i&gt;m[i]为真，所以i=0,1时均为假，i=2,3时为真，输出1，2.<br/>
</p></dd>
</dl>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> equal_range()</h3>
<div class="outline-text-3" id="text-1-4">

<dl>
<dt>形式</dt><dd>
<p>
   pair&lt;iterator, iterator&gt; equal_range( const key_type&amp; key );<br/>
</p></dd>
<dt>返回值</dt><dd>
<p>
   The function equal_range() returns two iterators - one to the first element that contains key, another to a point just after the last element that contains key. <br/>
   返回第一个find的iterator与最后一个find的下一个iterator。<br/>
</p></dd>
</dl>

</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> upper_bound lower_bound</h3>
<div class="outline-text-3" id="text-1-5">

<p>   iterator upper_bound( const key_type&amp; key );<br/>
   iterator lower_bound( const key_type&amp; key );<br/>
   返回第一个大于/小于的iterator.<br/>
</p></div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> size() max_size()</h3>
<div class="outline-text-3" id="text-1-6">

<p>   前者返回map大小，后者返回map最大的存储个数。<br/>
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> set</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> insert</h3>
<div class="outline-text-3" id="text-2-1">

<p>   使用方法与map完全相同。当参数为iterator时返回值为void，当参数为value_type时返回一个iterator和bool。<br/>
</p>


<pre class="src src-c++"><span style="color: #228b22;">set</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #a0522d;">iset</span>;
iset.insert(1);
<span style="color: #228b22;">pair</span>&lt;<span style="color: #008b8b;">set</span>&lt;<span style="color: #228b22;">int</span>&gt;::iterator, <span style="color: #228b22;">bool</span>&gt; <span style="color: #a0522d;">bset</span> = iset.insert(1);
<span style="color: #a020f0;">if</span>(!bset.second)
    cout&lt;&lt;<span style="color: #8b2252;">"Already exist"</span>&lt;&lt;endl;
</pre>

<script src="../../Layout/JS/disqus-comment.js"></script>
<div id="disqus_thread">
</div>
</div>
</div>
</div>
</div>

</body>
</html>
